[Killed] StringLiteral
main/components/Articles/ArticlesForm.js:74:43
                             type="text"
                             isInvalid={Boolean(errors.url)}
                             {...register("url", {
-                                required: "URL is required."
+                                required: ""
                             })}
                         />
killedBy: Articles tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /URL is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
