[Killed] StringLiteral
main/components/Articles/ArticlesTable.js:33:23
     const columns = [
         {
             Header: 'Id',
-            accessor: 'id', // accessor is the "key" in the data
+            accessor: "", // accessor is the "key" in the data
         },
         {
killedBy: ArticlesTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
