[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:60:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requesterEmail && "Requester Email is not a valid email."}
+                            {errors.requesterEmail || "Requester Email is not a valid email."}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Requester Email/

Here are the matching elements:

<label
  class="form-label"
  for="requesterEmail"
>

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:60:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requesterEmail && "Requester Email is not a valid email."}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Requester Email is not a valid email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:78:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.professorEmail && 'Professor Email is not a valid email. '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Professor Email is not a valid email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:78:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.professorEmail && 'Professor Email is not a valid email. '}
+                            {errors.professorEmail || 'Professor Email is not a valid email. '}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Professor Email/

Here are the matching elements:

<label
  class="form-label"
  for="professorEmail"
>
