[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:64:45
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "RecommendationRequestTable"));
+        columns.push(ButtonColumn("Delete", "", deleteCallback, "RecommendationRequestTable"));
     } 
 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn
