[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:39:36
         mutation.mutate(data);
       }
     
-      if (isSuccess && !storybook) {
-        return <Navigate to="/RecommendationRequest" />
-      }
+      if (isSuccess && !storybook) {}
     
       return (
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/RecommendationRequest"}

Number of calls: 0
