[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:5:74
 import { useForm } from 'react-hook-form'
 import { useNavigate } from 'react-router-dom';
 
-function OrganizationForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+function OrganizationForm({ initialContents, submitAction, buttonLabel = "" }) {
 
     
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /UCSBOrganization
statusReason: TestingLibraryElementError: Unable to find an element with the text: Create. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:32:38
                         data-testid={testIdPrefix + "-orgCode"}
                         id="orgCode"
                         type="text"
-                        {...register("orgCode", {
+                        {...register("", {
                             required: "orgCode is required."
                         })}
killedBy: UCSBOrganizationEditPageEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:47:53
             <Form.Group className="mb-3" >
                 <Form.Label htmlFor="orgTranslationShort">orgTranslationShort</Form.Label>
                 <Form.Control
-                    data-testid={/*testIdPrefix +*/ "OrganizationForm-orgTranslationShort"}
+                    data-testid={/*testIdPrefix +*/ ""}
                     id="orgTranslationShort"
                     type="text"
killedBy: UCSBOrganizationEditPageEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="OrganizationForm-orgTranslationShort"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationForm.js:51:57
                     id="orgTranslationShort"
                     type="text"
                     isInvalid={Boolean(errors.orgTranslationShort)}
-                    {...register("orgTranslationShort", {
-                        required: "orgTranslationShort is required."
-                    })}
+                    {...register("orgTranslationShort", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: OrganizationForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /orgTranslationShort is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
