[Killed] ObjectLiteral
main/components/UCSBOrganizations/UCSBOrganizationTable.js:33:9
     const deleteCallback = async (cell) => { deleteMutation.mutate(cell); }
 
     const columns = [
-        {
-            Header: 'orgCode',
-            accessor: 'orgCode', // accessor is the "key" in the data
-        },
+        {},
 
         {
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/UCSBOrganizations/UCSBOrganizationTable.js:49:23
         {
             Header: 'inactive',
             //accessor: 'inactive',
-            accessor: (row, _rowIndex) => String(row.inactive),
+            accessor: () => undefined,
         }
     ];
killedBy: OrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  false
Received:
