[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:9:33
 
 export default function UCSBOrganizationCreatePage({storybook=false}) {
 
-    const objectToAxiosParams = (organizations) => ({
-      url: "/api/UCSBOrganization/post",
-      method: "POST",
-      params: {
-        orgCode: organizations.orgCode,
-        orgTranslationShort: organizations.orgTranslationShort,
-        orgTranslation: organizations.orgTranslation,
-        inactive: organizations.inactive
-      }
-    });
+    const objectToAxiosParams = () => undefined;
  
     const onSuccess = (organizations) => {
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /UCSBOrganization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:10:12
 export default function UCSBOrganizationCreatePage({storybook=false}) {
 
     const objectToAxiosParams = (organizations) => ({
-      url: "/api/UCSBOrganization/post",
+      url: "",
       method: "POST",
       params: {
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /UCSBOrganization
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New UCSB Organization Created - orgCode: KRC"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:20:42
       }
     });
  
-    const onSuccess = (organizations) => {
-      toast(`New UCSB Organization Created - orgCode: ${organizations.orgCode}`);
-    }
+    const onSuccess = (organizations) => {}
  
     const mutation = useBackendMutation(
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /UCSBOrganization
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New UCSB Organization Created - orgCode: KRC"

Number of calls: 0
