[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:15:13
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             [`/api/UCSBOrganization?orgCode=${id}`],
-            {  // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-                method: "GET",
-                url: `/api/UCSBOrganization`,
-                params: {
-                    orgCode:id
-                }
-            }
+            {}
         );
 
killedBy: UCSBOrganizationEditPageEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="OrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:18:25
             {  // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
                 method: "GET",
                 url: `/api/UCSBOrganization`,
-                params: {
-                    orgCode:id
-                }
+                params: {}
             }
         );
killedBy: UCSBOrganizationEditPageEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="OrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (organizations) => ({
-        url: "/api/UCSBOrganization",
-        method: "PUT",
-        params: {
-            orgCode: organizations.orgCode,
-        },
-        data: {
-          orgCode: organizations.orgCode,
-          orgTranslationShort: organizations.orgTranslationShort,
-          orgTranslation: organizations.orgTranslation,
-          inactive: organizations.inactive,
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (organizations) => {
killedBy: UCSBOrganizationEditPageEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSB Organization Updated - orgCode: KRC"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:27:17
     const objectToAxiosPutParams = (organizations) => ({
         url: "/api/UCSBOrganization",
         method: "PUT",
-        params: {
-            orgCode: organizations.orgCode,
-        },
+        params: {},
         data: {
           orgCode: organizations.orgCode,
killedBy: UCSBOrganizationEditPageEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "orgCode": "KRC",
- }

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:30:15
         params: {
             orgCode: organizations.orgCode,
         },
-        data: {
-          orgCode: organizations.orgCode,
-          orgTranslationShort: organizations.orgTranslationShort,
-          orgTranslation: organizations.orgTranslation,
-          inactive: organizations.inactive,
-        }
+        data: {}
     });
 
killedBy: UCSBOrganizationEditPageEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"orgCode\":\"KRC\",\"orgTranslationShort\":\"Cooling\",\"orgTranslation\":\"Coolest\",\"inactive\":\"true\"}"
Received: "{}"

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:38:42
         }
     });
 
-    const onSuccess = (organizations) => {
-        toast(`UCSB Organization Updated - orgCode: ${organizations.orgCode}`);
-    }
+    const onSuccess = (organizations) => {}
 
     const mutation = useBackendMutation(
killedBy: UCSBOrganizationEditPageEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:39:15
     });
 
     const onSuccess = (organizations) => {
-        toast(`UCSB Organization Updated - orgCode: ${organizations.orgCode}`);
+        toast(``);
     }
 
killedBy: UCSBOrganizationEditPageEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSB Organization Updated - orgCode: KRC"
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:64:21
             <div className="pt-2">
                 <h1>Edit UCSB Organization</h1>
                 {
-                    organizations && <OrganizationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={organizations} />
+                    true
                 }
             </div>
killedBy: UCSBOrganizationEditPageEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="OrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:64:21
             <div className="pt-2">
                 <h1>Edit UCSB Organization</h1>
                 {
-                    organizations && <OrganizationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={organizations} />
+                    false
                 }
             </div>
killedBy: UCSBOrganizationEditPageEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="OrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
