[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:76:31
                   type="text"
                   isInvalid={Boolean(errors.teamId)}
                   {...register("teamId", {
-                    required: "teamId is required.",
+                    required: "",
                   })}
                 />
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /teamId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
