[Killed] ArrowFunction
main/pages/HelpRequest/HelpRequestCreatePage.js:9:31
 
 export default function HelpRequestCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (helpRequest) => ({
-    url: "/api/helprequest/post",
-    method: "POST",
-    params: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/HelpRequest/HelpRequestCreatePage.js:12:13
   const objectToAxiosParams = (helpRequest) => ({
     url: "/api/helprequest/post",
     method: "POST",
-    params: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved
-    }
+    params: {}
   });
 
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Object {
-   "explanation": "help on team03",
-   "requestTime": "2024-05-09T00:36",

[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestCreatePage.js:22:38
     }
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(`New helpRequest Created - id: ${helpRequest.id} teamId: ${helpRequest.teamId}`);
-  }
+  const onSuccess = (helpRequest) => {}
 
   const mutation = useBackendMutation(
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New helpRequest Created - id: 4 teamId: team10"

Number of calls: 0

[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestCreatePage.js:23:11
   });
 
   const onSuccess = (helpRequest) => {
-    toast(`New helpRequest Created - id: ${helpRequest.id} teamId: ${helpRequest.teamId}`);
+    toast(``);
   }
 
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New helpRequest Created - id: 4 teamId: team10"
Received: ""

Number of calls: 1

[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestCreatePage.js:39:32
     mutation.mutate(data);
   }
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/helprequest" />
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: HelpRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/helprequest"}

Number of calls: 0
