[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemTable.js:38:23
         },
         {
             Header: 'diningcommonscode',
-            accessor: 'diningcommonscode',
+            accessor: "",
         },
         {
killedBy: UCSBDiningCommonsMenuItemTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  dining commons menu item 2
Received:
