[Killed] BlockStatement
src/main/utils/UCSBDiningCommonsMenuItemUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/ucsbdiningcommonsmenuitem",
-        method: "DELETE",
-        // Stryker disable all
-        params: {
-            id: cell.row.values.id
-        }
-        // Stryker restore all
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
killedBy: UCSBDiningCommonsMenuItemIndexPage tests Deleting as an admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDiningCommonsMenuItem 1 deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
